// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	Если БаллыКСписанию > 0 Тогда 
	
		ИтогоСумма = Билеты.Итог("Сумма");
		
		Если БаллыКСписанию > ИтогоСумма Тогда
			Отказ = Истина;
			
			Поле = "БаллыКСписанию";
			ТекстШаблона = "Списанные балы: %1 не должны превышать итоговую сумму: %2";
			ТекстСообщения = СтрШаблон(ТекстШаблона, БаллыКСписанию, ИтогоСумма);
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Поле);
		КонецЕсли;

		Если ИтогоСумма > 0 Тогда
			МаксимальнаяДоля = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
			Доля = Окр(БаллыКСписанию / ИтогоСумма * 100, 2, 1);
			
			Если Доля > МаксимальнаяДоля Тогда
				Отказ = Истина;
				
				Поле = "БаллыКСписанию";
				ТекстШаблона = "Списанные балы: %1 не должны превышать макс долю списания: %2";
				ТекстСообщения = СтрШаблон(ТекстШаблона, Доля, МаксимальнаяДоля);

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Поле);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;		

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ПосещенияАттракционов.Записывать = Истина;
	Движения.ПродажиБилетов.Записывать = Истина;

	Выборка = СвойстваНоменклатуры();

	Пока Выборка.Следующий() Цикл
		// регистр ПосещенияАттракционов
		ДвижениеПосещения = Движения.ПосещенияАттракционов.Добавить();
		ДвижениеПосещения.Период = Дата;
		ДвижениеПосещения.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеПосещения.Основание = Ссылка;
		ДвижениеПосещения.ВидАттракциона = Выборка.ВидАттракциона;
		ДвижениеПосещения.КоличествоПосещений = Выборка.КоличествоПосещений;
	
		// Регистр ПродажиБилетов
		ДвижениеПродажи = Движения.ПродажиБилетов.Добавить();
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Клиент = Клиент;
		ДвижениеПродажи.ВидАттракциона = Выборка.ВидАттракциона;
		ДвижениеПродажи.Номенклатура = Выборка.Номенклатура;
		ДвижениеПродажи.Сумма = Выборка.Сумма;
	КонецЦикла;
	
	ОбработатьБонусныеБаллы(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СвойстваНоменклатуры()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаБилетаБилеты.Номенклатура.ВидАттракциона КАК ВидАттракциона,
		|	ПродажаБилетаБилеты.Номенклатура.КоличествоПосещений * ПродажаБилетаБилеты.Количество КАК КоличествоПосещений,
		|	ПродажаБилетаБилеты.Номенклатура КАК Номенклатура,
		|	ПродажаБилетаБилеты.Сумма КАК Сумма
		|ИЗ
		|	Документ.ПродажаБилета.Билеты КАК ПродажаБилетаБилеты
		|ГДЕ
		|	ПродажаБилетаБилеты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции	

// Обработать бонусные баллы.
// 
// Параметры:
//  Отказ - Булево - Отказ
Процедура ОбработатьБонусныеБаллы(Отказ)

	Движения.БонусныеБаллыКлиентов.Записывать = Истина;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат;	
	КонецЕсли;				
	
	СуммаПокупокКлиента = СуммаПокупокКлиента();
	ДоляНакопленныхБаллов = ДоляНакопленныхБаллов(СуммаПокупокКлиента);
	БаллыКНакоплению = СуммаДокумента * ДоляНакопленныхБаллов / 100;
	
	Если Не БаллыКНакоплению = 0 Тогда
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Сумма = БаллыКНакоплению;
	КонецЕсли;	
	
	Если Не БаллыКСписанию = 0 Тогда
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Сумма = БаллыКСписанию;
	КонецЕсли;	
	
	// Проверка перерасхода накопленных балов для клиента
	Движения.БонусныеБаллыКлиентов.Записать();
	
	ПерерасходБаллов = ПерерасходБаллов();
	
	Если ПерерасходБаллов > 0 Тогда
		Отказ = Истина;
		
		Поле = "БаллыКСписанию";
		ТекстСообщения = СтрШаблон("Не хватает %1 баллов для списания", ПерерасходБаллов);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Поле);
	КонецЕсли;	 
	
КонецПроцедуры	

// Сумма покупок клиента.
// 
// Возвращаемое значение:
//  Число - Сумма покупок клиента
Функция СуммаПокупокКлиента()
	
	СуммаПокупокКлиента = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажиБилетовОбороты.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.ПродажиБилетов.Обороты(, &КонецПериода,, Клиент = &Клиент) КАК ПродажиБилетовОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		СуммаПокупокКлиента = ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;	
	
	Возврат СуммаПокупокКлиента;
	
КонецФункции	

Функция ДоляНакопленныхБаллов(СуммаПокупокКлиента)
	
	ДоляНакопленныхБалов = 0;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктуальнаяШкалаБонуснойПрограммыСрезПоследних.Шкала КАК Шкала
		|ПОМЕСТИТЬ ВТАктуальныеШкалы
		|ИЗ
		|	РегистрСведений.АктуальнаяШкалаБонуснойПрограммы.СрезПоследних(&Период,) КАК
		|		АктуальнаяШкалаБонуснойПрограммыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШкалаБонуснойПрограммыДиапазоны.ПроцентНакопления КАК Доля
		|ИЗ
		|	ВТАктуальныеШкалы КАК ВТАктуальныеШкалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ШкалаБонуснойПрограммы.Диапазоны КАК ШкалаБонуснойПрограммыДиапазоны
		|		ПО ВТАктуальныеШкалы.Шкала = ШкалаБонуснойПрограммыДиапазоны.Ссылка
		|ГДЕ
		|	ШкалаБонуснойПрограммыДиапазоны.НижняяГраница <= &СуммаПокупок
		|	И (ШкалаБонуснойПрограммыДиапазоны.ВерхняяГраница > &СуммаПокупок
		|	ИЛИ ШкалаБонуснойПрограммыДиапазоны.ВерхняяГраница = 0)";
		
	Запрос.УстановитьПараметр("СуммаПокупок", СуммаПокупокКлиента);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ДоляНакопленныхБалов = ВыборкаДетальныеЗаписи.Доля;		
	КонецЕсли;		
	
	Возврат ДоляНакопленныхБалов;
	
КонецФункции	

Функция ПерерасходБаллов()
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БонусныеБаллыКлиентовОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.БонусныеБаллыКлиентов.Остатки(&Период, Клиент = &Клиент) КАК БонусныеБаллыКлиентовОстатки
		|ГДЕ
		|	БонусныеБаллыКлиентовОстатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = -ВыборкаДетальныеЗаписи.Сумма;	
	КонецЕсли;	
	
	Возврат Результат;
		
КонецФункции	

#КонецОбласти

#КонецЕсли