
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементов(Объект.ВидНоменклатуры, Элементы);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)

	УстановитьВидимостьЭлементов(Объект.ВидНоменклатуры, Элементы);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Установить видимость элементов.
// 
// Параметры:
//  ВидНоменклатуры - ПеречислениеСсылка.ВидНоменклатуры - Вид номенклатуры
//  Элементы - ВсеЭлементыФормы - Элементы
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Знач ВидНоменклатуры, Элементы)

	ЭтоПосещениеАттракциона = ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидНоменклатуры.ПосещениеАттракциона");
	
	Элементы.ВидАттракциона.Видимость = ЭтоПосещениеАттракциона;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАттракциона;
	
КонецПроцедуры

#КонецОбласти
