// @strict-types


#Область ПрограммныйИнтерфейс

// Выводит сообщение пользователю
// 
// Параметры:
//  ТекстСообщения - Строка - Текст сообщения
//  Поле - Строка - Поле для вывода сообщения
//  КлючДанных - ЛюбаяСсылка - ссылка на объект базы данных 
Процедура СообщитьПользователю(ТекстСообщения, Поле = "", КлючДанных = Неопределено) Экспорт

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле = Поле;
	Сообщение.КлючДанных = КлючДанных;
	Сообщение.Сообщить();	
	
КонецПроцедуры

#КонецОбласти

