// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ГруппаПодбор.Видимость = Ложь;
	
	ВидимостьДекорацииБаллыКлиента();
	
	ИнициализироватьПопулярныеАттракционы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыКСписаниюПриИзменении(Элемент)
	
	РассчитатьСуммуИтого();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаИтогоПриИзменении(Элемент)
	
	РассчитатьБаллыКСписанию();
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)

	КлиентПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБаллыКлиентаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки  = "#ЗаполнитьБаллыКСписанию" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПеренестиБаллыКСписанию();
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

// Обрабатывает выбор элемента в списке номенклатуры и добавляет выбранный товар в список билетов.
// 
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, вызвавший событие.
//  ВыбраннаяСтрока - СправочникСсылка.Номенклатура - Номенклатура выбранной строки 
//  Поле - ПолеФормы - Поле, в котором был сделан выбор.
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной обработки системой.
&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элемент.ТекущиеДанные;

	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокуВБилеты(ДанныеСтроки);
	
КонецПроцедуры

// Список номенклатуры начало перетаскивания.
// 
// Параметры:
//  Элемент - ТаблицаФормы - Элемент
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры перетаскивания
//  Выполнение - Булево - Выполнение
&НаКлиенте
Процедура СписокНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = ЗначенияПараметровПеретаскивания(ДанныеСтроки); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБилеты

&НаКлиенте
Процедура БилетыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ДанныеСтроки = ПараметрыПеретаскивания.Значение;// см. ЗначенияПараметровПеретаскивания 
			
	Если Не ТипЗнч(ДанныеСтроки) = Тип("Структура") 
			или ДанныеСтроки.Свойство("Номенклатура") = Неопределено
	Тогда
		Возврат;		
	КонецЕсли;	
	
	ДобавитьСтрокуВБилеты(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Билеты.ТекущиеДанные;
	
	ТекущиеДанные.Цена = ЦенаНоменклатуры(ТекущиеДанные.Номенклатура);
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыЦенаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Билеты.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыКоличествоПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Билеты.ТекущиеДанные;

	РассчитатьСуммуСтроки(ДанныеСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыполнитьПродажу(Команда)
	
	ТекстВопроса = "Выполнить создание документа ""Продажа билета""?";
	
	Обещание = ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Ответ = Ждать Обещание;// КодВозвратаДиалога	
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	ДокументСсылка = СоздатьДокументПродажаБилета();
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда	
		ОповеститьОбИзменении(ДокументСсылка);
		
		ПоказатьОповещениеПользователя("Создан документ",
				ПолучитьНавигационнуюСсылку(ДокументСсылка),
				Строка(ДокументСсылка));
				
		СброситьЗаполнениеФормы();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ВидимостьГруппы = Элементы.ГруппаПодбор.Видимость;
	
	Элементы.ГруппаПодбор.Видимость = Не ВидимостьГруппы;
	
	Элементы.БилетыПодбор.Пометка = Элементы.ГруппаПодбор.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СброситьЗаполнениеФормы()
	
	Билеты.Очистить();
	СуммаИтого = 0;
	БаллыКСписанию = 0;
	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьСтрокуВБилеты(ДанныеСтроки)
	
	ПараметрыОтбора = Новый Структура("Номенклатура", ДанныеСтроки.Номенклатура);
	НайденныеСтроки = Билеты.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() Тогда
		Возврат;		
	КонецЕсли;	
	
	НоваяСтрока = Билеты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки, "Номенклатура, Цена");
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = НоваяСтрока.Цена;
	
	РассчитатьСуммуИтого();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦенаНоменклатуры(Знач Номенклатура)
	
	ЦенаНоменклатуры = РегистрыСведений.ЦеныНоменклатуры.ЦенаНоменклатуры(Номенклатура, ТекущаяДатаСеанса());
	
	Возврат ЦенаНоменклатуры;
	
КонецФункции	

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ДанныеСтроки)

	ДанныеСтроки.Сумма = ДанныеСтроки.Цена * ДанныеСтроки.Количество;
	
	РассчитатьСуммуИтого();
	
КонецПроцедуры	

&НаКлиенте
Процедура РассчитатьСуммуИтого()
	
	СуммаИтого = Билеты.Итог("Сумма") - БаллыКСписанию;
	
	ОбновитьБаллыКлиента();
	
	Элементы.ДекорацияБаллыКлиента.Заголовок = ЗаголовокДекорацииБаллыКлиента();
	
КонецПроцедуры

&НаКлиенте 
Процедура РассчитатьБаллыКСписанию()
	
	БаллыКСписанию = Билеты.Итог("Сумма") - СуммаИтого;
	
КонецПроцедуры	

&НаСервере
Функция СоздатьДокументПродажаБилета()
	
	ДокументСсылка = Документы.ПродажаБилета.ПустаяСсылка();

	ДокументОбъект = Документы.ПродажаБилета.СоздатьДокумент();
	ДокументОбъект.Заполнить(Неопределено);
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Клиент = Клиент;
	ДокументОбъект.Билеты.Загрузить(Билеты.Выгрузить());
	ДокументОбъект.БаллыКСписанию = БаллыКСписанию;
	ДокументОбъект.СуммаДокумента = СуммаИтого;
	
	Если Не ДокументОбъект.ПроверитьЗаполнение() Тогда
		ТекстСообщения = "Не удалось записать документ";
		
		ВызватьИсключение ТекстСообщения;	
	КонецЕсли;	
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументСсылка = ДокументОбъект.Ссылка;
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтрШаблон("Не удалось провести документ по причине: %1%2", Символы.ПС, ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;			
	
	Возврат ДокументСсылка;
	
КонецФункции	

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	
	СброситьЗаполнениеФормы();

	ОбновитьБаллыКлиента();

	ЗаполнитьПопулярныеАттракционы();	
	
	ВидимостьДекорацииБаллыКлиента();
	
	Элементы.ДекорацияБаллыКлиента.Заголовок = ЗаголовокДекорацииБаллыКлиента();
	
КонецПроцедуры	

&НаСервере
Процедура ВидимостьДекорацииБаллыКлиента()
	
	Элементы.ДекорацияБаллыКлиента.Видимость = ЗначениеЗаполнено(Клиент);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьБаллыКлиента()

	ОстатокБаллов = 0;
	МожноСписатьБаллов = 0;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат;
	КонецЕсли;	
	
	// Обновляем баллы если клиент заполнен
	ОстатокБаллов = ОстатокБаллов(Клиент);
	МожноСписатьБаллов = МожноСписатьБаллов(Клиент, СуммаИтого, ОстатокБаллов);
		
КонецПроцедуры		

&НаСервереБезКонтекста
Функция ОстатокБаллов(Знач Клиент)
	
	ОстатокБаллов = 0;
	
	// TODO: вынести в общий модуль если используется еще где то
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БонусныеБаллыКлиентовОстатки.СуммаОстаток КАК ОстатокБаллов
		|ИЗ
		|	РегистрНакопления.БонусныеБаллыКлиентов.Остатки(, Клиент = &Клиент) КАК БонусныеБаллыКлиентовОстатки";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОстатокБаллов;
	КонецЕсли;
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОстатокБаллов = ВыборкаДетальныеЗаписи.ОстатокБаллов;
	КонецЕсли;
	
	Возврат ОстатокБаллов;
	
КонецФункции

&НаСервереБезКонтекста
Функция МожноСписатьБаллов(Знач Клиент, Знач СуммаИтого, Знач ОстатокБаллов)
	
	МожноСписатьБаллов = 0;
	
	Если ОстатокБаллов > 0 Тогда
		МаксимальнаяДоля = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
		МожноСписатьБаллов = Мин(ОстатокБаллов, Окр(СуммаИтого * МаксимальнаяДоля/100, 0));
	КонецЕсли;
	
	Возврат МожноСписатьБаллов;
	
КонецФункции	

&НаСервере
Функция ЗаголовокДекорацииБаллыКлиента()
	
	ЗаголовокДекорации = "У клиента нет начисленных баллов";

	Если ОстатокБаллов > 0 Тогда
		Шаблон = "Накоплено %1 баллов, из них можно списать %2. ";
		ПерваяСтрока = СтрШаблон(Шаблон, ОстатокБаллов, МожноСписатьБаллов);
		ВтораяСтрока = Новый ФорматированнаяСтрока("Перенести в ""Баллы к списанию""",,,, "#ЗаполнитьБаллыКСписанию");
		
		ЧастиСтроки = Новый Массив;// Массив из Строка, ФорматированнаяСтрока
		ЧастиСтроки.Добавить(ПерваяСтрока);
	
		Если МожноСписатьБаллов > 0 Тогда
			ЧастиСтроки.Добавить(ВтораяСтрока);
		КонецЕсли;	
		
		ЗаголовокДекорации = Новый ФорматированнаяСтрока(ЧастиСтроки);
	КонецЕсли;	
	
	Возврат ЗаголовокДекорации;
	
КонецФункции	

// Значения параметров перетаскивания.
// 
// Параметры:
//  ДанныеСтроки - ДанныеФормыЭлементДерева, ДанныеФормыСтруктура, ДанныеФормыЭлементКоллекции - Данные строки
// 
// Возвращаемое значение:
//  Структура - Значения параметров перетаскивания:
// * Номенклатура - СправочникСсылка.Номенклатура - 
// * Цена - Число - 
&НаКлиенте
Функция ЗначенияПараметровПеретаскивания(ДанныеСтроки)
	
	ЗначенияПараметров = Новый Структура;
	ЗначенияПараметров.Вставить("Номенклатура", ДанныеСтроки.Ссылка);
	ЗначенияПараметров.Вставить("Цена", ДанныеСтроки.Цена);

	Возврат ЗначенияПараметров;	
	
КонецФункции

&НаКлиенте
Асинх Процедура ПеренестиБаллыКСписанию()
	
	ТекстВопроса = "Перенести доступные баллы в ""Баллы к списанию"" ?";
	Обещание = ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

	Ответ = Ждать Обещание;// КодВозвратаДиалога

	Если Ответ = КодВозвратаДиалога.Да Тогда
		БаллыКСписанию = МожноСписатьБаллов;
		РассчитатьСуммуИтого();
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ИнициализироватьПопулярныеАттракционы()
	
	Элементы.ГруппаПопулярныеАттракционы.Видимость = Ложь;
	
	ПопулярныеАттракционы.Очистить();
	
	КоличествоСтрок = 3;// количество популярных аттракицонов
	
	Для Номер = 1 по КоличествоСтрок Цикл
		НоваяСтрока = ПопулярныеАттракционы.Добавить();
		НоваяСтрока.ИмяЭлемента = СтрШаблон("ДекорацияПопулярныйАттракцион%1", XMLСтрока(Номер));
	КонецЦикла;	
	
	Родитель = Элементы.ГруппаПопулярныеАттракционы;
	 	
	// Добавление декораций на форму (для каждой строки таблицы) 
	Для Каждого СтрокаТаблицы из ПопулярныеАттракционы Цикл
		Декорация = Элементы.Добавить(СтрокаТаблицы.ИмяЭлемента,Тип("ДекорацияФормы"), Родитель);
		Декорация.Вид = ВидДекорацииФормы.Надпись;
		Декорация.Видимость = Ложь;
		Декорация.Гиперссылка = Истина;	
		Декорация.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияПопулярногоАттракционаНажатие");			
	КонецЦикла;	
		
КонецПроцедуры	

&НаСервере
Процедура СброситьПопулярныеАттракционы() 

	Для Каждого СтрокаТаблицы из ПопулярныеАттракционы Цикл
		СтрокаТаблицы.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();			
		СтрокаТаблицы.Активность = Ложь;
	КонецЦикла;	 
		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПопулярныеАттракционы()
	
	СброситьПопулярныеАттракционы();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 3
		|	ПродажиБилетовОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиБилетовОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.ПродажиБилетов.Обороты(&НачалоПериода, &КонецПериода, Период, Клиент = &Клиент) КАК
		|		ПродажиБилетовОбороты
		|ГДЕ
		|	ПродажиБилетовОбороты.СуммаОборот > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаОборот УБЫВ";
	
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(ТекущаяДатаСеанса(), -3));
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();

	Элементы.ГруппаПопулярныеАттракционы.Видимость = Не РезультатЗапроса.Пустой();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Индекс = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Индекс > ПопулярныеАттракционы.Количество() - 1 Тогда
			Прервать;
		КонецЕсли;	
		
		СтрокаТаблицы = ПопулярныеАттракционы[Индекс];
		СтрокаТаблицы.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		СтрокаТаблицы.Активность = Истина;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	ОбновитьПопулярныеАттракционыНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПопулярныеАттракционыНаФорме()

	Для Каждого СтрокаТаблицы из ПопулярныеАттракционы Цикл
		Элемент = Элементы[СтрокаТаблицы.ИмяЭлемента];
		
		Элемент.Видимость = СтрокаТаблицы.Активность;
		Элемент.Заголовок = Строка(СтрокаТаблицы.Номенклатура);
	КонецЦикла;	
	
КонецПроцедуры	


// Подключаемый декорация популярного аттракциона нажатие.
// 
// Параметры:
//  Элемент - ДекорацияФормы - Элемент
&НаКлиенте
Процедура Подключаемый_ДекорацияПопулярногоАттракционаНажатие(Элемент)

	ПараметрыОтбора = Новый Структура("ИмяЭлемента", Элемент.Имя);
	НайденныеСтроки = ПопулярныеАттракционы.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;	
	 	
 	СтрокаТаблицы = НайденныеСтроки[0];
 	
 	ДанныеСтроки = Новый Структура();
 	ДанныеСтроки.Вставить("Номенклатура", СтрокаТаблицы.Номенклатура);
 	ДанныеСтроки.Вставить("Цена", ЦенаНоменклатуры(СтрокаТаблицы.Номенклатура));
	
	ДобавитьСтрокуВБилеты(ДанныеСтроки);
	
КонецПроцедуры	

#КонецОбласти
